#+property: header-args:sqlite  :dir ~/Público/caged_dashboard/data/
#+property: header-args:sqlite+ :db caged.db
#+property: header-args:sqlite+ :header on
#+property: header-args:sqlite+ :colnames yes    

* Comparação salarial por ocupação (CBO2002)

  Este repositório concentra os scripts necessários para confecção de um /dashboard/ em python (usando a biblioteca =dash=).
  
  *Fonte:* Novo CAGED, microdados disponíveis em ftp://ftp.mtps.gov.br/pdet/microdados/, acesso em 04.12.2021.

  Vide =Makefile= para documentação técnica sucinta para construção da base de comparação salarial:

  #+begin_src shell :exports results :results verbatim
  make help
  #+end_src

  #+RESULTS:
  #+begin_example
  Documentação do Makefile para construção da base de comparação salarial

  Uso:
	  make [alvo]

  Alvos:
	  init-debian-based    Instalação dos softwares necessários em distribuições baseadas no Debian
	  fetch                Baixa e prepara dados brutos do novo caged para importação no banco de dados
	  db                   Cria e popula banco de dados caged.db com os dados brutos baixados do ftp do governo
	  help                 Exibe esta mensagem de ajuda

  #+end_example

* Queries

** Média por UF e profissão

   #+name: sqlite-uf-ocp
   #+begin_src sqlite 
   /* Base de cálculo para média de salário por estado*/
		 select cbo.codigo || ' - ' || cbo.descricao as cbo2002_ocupacao
				,uf.descricao as uf
				,round( avg(c.salario), 2) as salario_medio
		   from caged               as c
	  left join cbo2002ocupacao     as cbo  on c.cbo2002ocupacao     =  cbo.codigo
	  left join sexo                as sx   on c.sexo                =   sx.codigo
	  left join uf                          on c.uf                  =   uf.codigo
		  where c.saldomovimentacao = '1' -- desconsidera o salário no momento do desligamento
			and cbo.descricao in ('Estatistico')
	   group by 1,2
   ;
   #+end_src

   #+RESULTS: sqlite-uf-ocp
   | cbo2002_ocupacao     | uf                  | salario_medio |
   |----------------------+---------------------+---------------|
   | 211205 - Estatistico | Amazonas            |       3683.33 |
   | 211205 - Estatistico | Bahia               |       3322.98 |
   | 211205 - Estatistico | Ceará               |        3496.8 |
   | 211205 - Estatistico | Distrito Federal    |       6246.05 |
   | 211205 - Estatistico | Espírito Santo      |       2721.37 |
   | 211205 - Estatistico | Goiás               |        2893.6 |
   | 211205 - Estatistico | Mato Grosso         |        3500.0 |
   | 211205 - Estatistico | Mato Grosso do Sul  |        3275.5 |
   | 211205 - Estatistico | Minas gerais        |       3330.69 |
   | 211205 - Estatistico | Paraná              |       5218.98 |
   | 211205 - Estatistico | Paraíba             |       4021.88 |
   | 211205 - Estatistico | Pará                |       2353.49 |
   | 211205 - Estatistico | Pernambuco          |       3605.64 |
   | 211205 - Estatistico | Piauí               |        2000.0 |
   | 211205 - Estatistico | Rio Grande do Norte |       1847.69 |
   | 211205 - Estatistico | Rio Grande do Sul   |       8081.14 |
   | 211205 - Estatistico | Rio de Janeiro      |       7443.63 |
   | 211205 - Estatistico | Santa Catarina      |       5398.85 |
   | 211205 - Estatistico | São Paulo           |       8563.99 |



   
** Amostra da tabela base

   #+name: sqlite-tabela-base
   #+begin_src sqlite 
   /* Tabela base para o dashboard */
		 select c.competenciamov as mes
				,rg.descricao as regiao
				,uf.descricao as uf
				,mun.descricao as municipio
				,sc.codigo || ' - ' || sc.descricao as secao
				,cnae.codigo || ' - ' || cnae.descricao as cnae
				,ct.descricao as categoria
				,cbo.codigo || ' - ' || cbo.descricao as ocupacao
				,ed.descricao as instrucao
				,rc.descricao as raca
				,sx.descricao as sexo
				,tam.descricao as tamanho
				,c.salario
				,case when c.saldomovimentacao = '1' then 'admissão' else 'desligamento' end as movimentacao
				,def.descricao as deficiencia
				,tpar.descricao as trab_parcial
				,tint.descricao as trab_intermitente
				,orig.descricao as origem_info
		   from caged               as c
	  left join categoria           as ct   on c.categoria           =   ct.codigo
	  left join cbo2002ocupacao     as cbo  on c.cbo2002ocupacao     =  cbo.codigo
	  left join graudeinstrucao     as ed   on c.graudeinstrucao     =   ed.codigo
	  left join municipio           as mun  on c.municipio           =  mun.codigo
	  left join racacor             as rc   on c.racacor             =   rc.codigo
	  left join sexo                as sx   on c.sexo                =   sx.codigo
	  left join regiao              as rg   on c.regiao              =   rg.codigo
	  left join uf                          on c.uf                  =   uf.codigo
	  left join secao               as sc   on c.secao               =   sc.codigo
	  left join subclasse           as cnae on c.subclasse           = cnae.codigo
	  left join tamestabjan         as tam  on c.tamestabjan         =  tam.codigo
	  left join tipodeficiencia     as def  on c.tipodedeficiencia   =  def.codigo
	  left join indtrabintermitente as tint on c.indtrabintermitente = tint.codigo
	  left join indtrabparcial      as tpar on c.indtrabparcial      = tpar.codigo
	  left join indicadoraprendiz   as apr  on c.indicadoraprendiz   =  apr.codigo
	  left join origemdainformacao  as orig on c.origemdainformacao  = orig.codigo
		  where c.competenciamov >= '202009'
	        and c.competenciamov <= '202010'
			and cbo.descricao like '%tatistico%'
		  limit 5
   ;
   #+end_src

   #+RESULTS: sqlite-tabela-base
   |    mes | regiao   | uf       | municipio         | secao                                                | cnae                                                                                    | categoria                                                                                                | ocupacao             | instrucao              | raca          | sexo   | tamanho      | salario | movimentacao | deficiencia    | trab_parcial | trab_intermitente | origem_info |
   |--------+----------+----------+-------------------+------------------------------------------------------+-----------------------------------------------------------------------------------------+----------------------------------------------------------------------------------------------------------+----------------------+------------------------+---------------+--------+--------------+---------+--------------+----------------+--------------+-------------------+-------------|
   | 202009 | Norte    | Amazonas | Am-Manaus         | S - Outras Atividades de Serviços                    | 9430800 - Atividades de Associações de Defesa de Direitos Sociais                       | Não Identificado                                                                                         | 211205 - Estatistico | Superior Completo      | Parda         | Mulher | De 500 a 999 |    2875 | admissão     | Não Deficiente | Não          | Não               | CAGED       |
   | 202009 | Nordeste | Ceará    | Ce-Fortaleza      | M - Atividades Profissionais, Científicas e Técnicas | 6911701 - Serviços Advocatícios                                                         | Empregado - Geral, inclusive o empregado público da administração direta ou indireta contratado pela CLT | 211205 - Estatistico | Superior Completo      | Não informada | Homem  | De 20 a 49   |    3600 | admissão     | Não Deficiente | Não          | Não               | eSocial     |
   | 202009 | Nordeste | Ceará    | Ce-Fortaleza      | P - Educação                                         | 8513900 - Ensino Fundamental                                                            | Empregado - Geral, inclusive o empregado público da administração direta ou indireta contratado pela CLT | 211205 - Estatistico | Superior Completo      | Parda         | Homem  | De 100 a 249 | 1466.48 | desligamento | Não Deficiente | Não          | Não               | eSocial     |
   | 202009 | Nordeste | Paraíba  | Pb-Campina Grande | H - Transporte, Armazenagem e Correio                | 4921301 - Transporte Rodoviário Coletivo de Passageiros, com Itinerário Fixo, Municipal | Empregado - Geral, inclusive o empregado público da administração direta ou indireta contratado pela CLT | 211205 - Estatistico | Pós-Graduação completa | Parda         | Mulher | De 100 a 249 |     975 | desligamento | Não Deficiente | Não          | Não               | eSocial     |
   | 202009 | Nordeste | Paraíba  | Pb-Campina Grande | H - Transporte, Armazenagem e Correio                | 4921301 - Transporte Rodoviário Coletivo de Passageiros, com Itinerário Fixo, Municipal | Empregado - Geral, inclusive o empregado público da administração direta ou indireta contratado pela CLT | 211205 - Estatistico | Pós-Graduação completa | Parda         | Mulher | De 250 a 499 |  1462.5 | desligamento | Não Deficiente | Não          | Não               | eSocial     |

  
